app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def show
    if logged_in? == false
      flash.now[:danger] = "Il faut être connecté.e pour voir le secret de l'Univers !"
      render 'new'
    else
      puts params["id"]
      user = User.find(params["id"])