app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(email: params[:session]["email"], password: params[:session]["password"], password_confirmation: params[:session]["password_confirmation"], name: params[:session]["name"])
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def edit
    puts params[:id]
    @user_new = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "diane"], ["email", "ezf@fzeiu.fze"], ["password_digest", "$2a$10$LKLlsxZ2NIsWbY9Zyf6vB.k7CFMrU.tpYROeNwxskBXWSbl60s5PK"], ["updated_at", "2018-08-02 23:54:24.812252"], ["id", 9]]
---
  def edit_after
    puts params[:id]
    @user_new = User.find(params[:id])
    if @user_new == @current_user
      @user_new.update_attributes(name: "params[:session][:name]", email: "params[:session][:email]")